leohou666/ESP32-PC-RemoteBoot/sdkconfig.defaults
# ESP32-S3 target
CONFIG_IDF_TARGET="esp32s3"

# Use custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# Flash size: 4MB
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# OTA rollback protection
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER=y
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1

# Increase system stack for HTTP operations
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# HTTP server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# TinyUSB - HID Keyboard
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_TINYUSB_DESC_USE_ESPRESSIF_VID=y
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="ESP32-RemoteBoot"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="RemoteBoot Keyboard"
CONFIG_TINYUSB_DESC_SERIAL_STRING="RB001"
CONFIG_TINYUSB_DESC_BCD_DEVICE=0x0100

# Reduce log level in production (use INFO)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# NVS encryption not required for home use
CONFIG_NVS_ENCRYPTION=n

# FreeRTOS tick rate
CONFIG_FREERTOS_HZ=1000

# PSRAM (ESP32-S3 Quad external RAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=n
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=128
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# LwIP
CONFIG_LWIP_SO_RCVTIMEO=y
CONFIG_LWIP_SO_SNDTIMEO=y
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y
